terjeio/grblHAL/drivers/ESP32/driver.c
void debounceTimerCallback (TimerHandle_t xTimer)
{
	  uint8_t grp = 0;

	  uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);
	  do {
	      i--;
	      if(inputpin[i].debounce && inputpin[i].active) {
	    	  inputpin[i].active = false; //gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
	    	  grp |= inputpin[i].group;
	      }
	  } while(i);

//	  printf("Debounce %d %d\n", grp, systemGetState().value);

	  if(grp & INPUT_GROUP_LIMIT)
		    hal.limit_interrupt_callback(limitsGetState());

	  if(grp & INPUT_GROUP_CONTROL)
		  hal.control_interrupt_callback(systemGetState());
}

// Configures perhipherals when settings are initialized or changed
static void settings_changed (settings_t *settings)
{
	uint32_t pwm_max_value = (1UL << ledTimerConfig.duty_resolution) - 1;

    spindle_pwm.period = (uint32_t)(80000000UL / settings->spindle.pwm_freq);
    spindle_pwm.off_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_off_value / 100.0f);
    spindle_pwm.min_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_min_value / 100.0f);
    spindle_pwm.max_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_max_value / 100.0f);
    spindle_pwm.pwm_gradient = (float)(spindle_pwm.max_value - spindle_pwm.min_value) / (settings->spindle.rpm_max - settings->spindle.rpm_min);

    hal.spindle_pwm_off = spindle_pwm.off_value;

    ledc_set_freq(ledTimerConfig.speed_mode, ledTimerConfig.timer_num, (uint32_t)settings->spindle.pwm_freq);

    if(IOInitDone) {

        switch(settings->stream) {
/*
            case StreamSetting_Ethernet:
                hal.serial_read = TCPStreamGetC;
                hal.serial_write = TCPStreamPutC;
                hal.serial_write_string = TCPStreamWriteS;
                hal.serial_get_rx_buffer_available = TCPStreamRxFree;
                hal.serial_reset_read_buffer = TCPStreamRxFlush;
                hal.serial_cancel_read_buffer = TCPStreamRxCancel;
                TCPStreamSetReceiveCallback(hal.protocol_process_realtime);
                break;
*/
            case StreamSetting_Serial:
                hal.serial_read = uartRead;
                hal.serial_write = uartWrite;
                hal.serial_write_string = uartWriteS;
                hal.serial_get_rx_buffer_available = uartRXFree;
                hal.serial_reset_read_buffer = uartFlush;
                hal.serial_cancel_read_buffer = uartCancel;
//                hal.serial_suspend_read = serialSuspendInput;
                setUARTReceiveCallback(hal.protocol_process_realtime);
                break;

            default:
            	break;
        }

        stepperEnable(settings->steppers.deenergize);

        /*********************
         * Step pulse config *
         *********************/

        initRMT(settings);

        /****************************************
         *  Control, limit & probe pins config  *
         ****************************************/

        bool pullup = true, ie = false;
        control_signals_t control_fei;
        gpio_config_t config;

        control_fei.mask = settings->control_disable_pullup.mask ^ settings->control_invert.mask;

        axes_signals_t limit_fei;
        limit_fei.mask = settings->limits.disable_pullup.mask ^ settings->limits.invert.mask;

        uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);

        do {
            switch(--i) {

                case INPUT_RESET:
                	ie = true;
                    pullup = !settings->control_disable_pullup.reset;
                    inputpin[i].invert = control_fei.reset;
                    break;

                case INPUT_FEED_HOLD:
                	ie = true;
                    pullup = !settings->control_disable_pullup.feed_hold;
                    inputpin[i].invert = control_fei.feed_hold;
                    break;

                case INPUT_CYCLE_START:
                	ie = true;
                    pullup = !settings->control_disable_pullup.cycle_start;
                    inputpin[i].invert = control_fei.cycle_start;
                    break;

                case INPUT_SAFETY_DOOR:
                	ie = true;
                    pullup = !settings->control_disable_pullup.safety_door_ajar;
                    inputpin[i].invert = control_fei.safety_door_ajar;
                    break;

                case INPUT_PROBE:
                    pullup = hal.driver_cap.probe_pull_up;
                    inputpin[i].invert = false;
                    break;

                case INPUT_LIMIT_X:
                    pullup = !settings->limits.disable_pullup.x;
                    inputpin[i].invert = limit_fei.x;
                    break;

                case INPUT_LIMIT_Y:
                    pullup = !settings->limits.disable_pullup.y;
                    inputpin[i].invert = limit_fei.y;
                    break;

                case INPUT_LIMIT_Z:
                    pullup = !settings->limits.disable_pullup.z;
                    inputpin[i].invert = limit_fei.z;
                    break;
            }

            pullup = pullup && inputpin[i].pin < 34;

            gpio_intr_disable(inputpin[i].pin);

            config.pin_bit_mask = 1ULL << inputpin[i].pin;
            config.mode = GPIO_MODE_INPUT;
            config.pull_up_en = pullup ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE;
            config.pull_down_en = pullup ? GPIO_PULLDOWN_DISABLE : GPIO_PULLDOWN_ENABLE;
            config.intr_type = ie ? (inputpin[i].invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE) : GPIO_INTR_DISABLE;

            inputpin[i].offset = config.pin_bit_mask > (1ULL << 31) ? 1 : 0;
            inputpin[i].mask = inputpin[i].offset == 0 ? (uint32_t)config.pin_bit_mask : (uint32_t)(config.pin_bit_mask >> 32);

//            printf("IN %d - %d -%d : %x\n", inputpin[i].pin,  inputpin[i].offset, inputpin[i].mask, inputpin[i].invert);

            gpio_config(&config);

            inputpin[i].active   = gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
            inputpin[i].debounce = hal.driver_cap.software_debounce;

        } while(i);
    }
}

void vStepperTask (void *pvParameters)
{
	while(true) {
		vTaskSuspend(NULL);
		hal.stepper_interrupt_callback();
	}
}

// Initializes MCU peripherals for Grbl use
static bool driver_setup (settings_t *settings)
{
    /******************
     *  Stepper init  *
     ******************/

